DROP DATABASE IF EXISTS studentdb;

CREATE DATABASE IF NOT EXISTS studentdb 
  DEFAULT CHARACTER SET utf8mb4 
  DEFAULT COLLATE utf8mb4_general_ci;

USE studentdb;

CREATE TABLE student (
    id INT NOT NULL,
	st_name VARCHAR(100) NOT NULL,
    academy_id VARCHAR(100) NOT NULL,
	star INT NOT NULL,
    weapon_type INT NOT NULL,
    attack_type INT NOT NULL,
    defence_type INT NOT NULL,
    PRIMARY KEY(id)
) ENGINE = InnoDB
  DEFAULT CHARACTER SET utf8mb4 
  DEFAULT COLLATE utf8mb4_general_ci;
  
CREATE TABLE academy (
    id INT NOT NULL,
    aca_id INT NOT NULL,
    club VARCHAR(100) NOT NULL,
    PRIMARY KEY(id)
) ENGINE = InnoDB
  DEFAULT CHARACTER SET utf8mb4 
  DEFAULT COLLATE utf8mb4_general_ci;
  
CREATE TABLE academyid (
    id INT NOT NULL,
    aca_name VARCHAR(100) NOT NULL,
    PRIMARY KEY(id)
) ENGINE = InnoDB
  DEFAULT CHARACTER SET utf8mb4 
  DEFAULT COLLATE utf8mb4_general_ci;
  
CREATE TABLE weapon (
    id INT NOT NULL,
    weapon VARCHAR(100) NOT NULL,
    PRIMARY KEY(id)
) ENGINE = InnoDB
  DEFAULT CHARACTER SET utf8mb4 
  DEFAULT COLLATE utf8mb4_general_ci;
  
CREATE TABLE Atype (
    id INT NOT NULL,
    types VARCHAR(100) NOT NULL,
    PRIMARY KEY(id)
) ENGINE = InnoDB
  DEFAULT CHARACTER SET utf8mb4 
  DEFAULT COLLATE utf8mb4_general_ci;

CREATE TABLE Dtype (
    id INT NOT NULL,
    types VARCHAR(100) NOT NULL,
    PRIMARY KEY(id)
) ENGINE = InnoDB
  DEFAULT CHARACTER SET utf8mb4 
  DEFAULT COLLATE utf8mb4_general_ci;

INSERT INTO student VALUES
    #아비도스
    (101, '시로코', 101, 3, 3, 1, 2),
    (102, '호시노', 101, 3, 5, 3, 4),
    (103, '세리카', 101, 2, 3, 1, 2),
    (104, '노노미', 101, 2, 6, 3, 2),
    (105, '아야네', 101, 2, 1, 3, 2),
    (106, '시로코(라이딩)', 101, 3, 3, 5, 4),
    (107, '세리카(새해)', 101, 3, 3, 3, 6),
    (108, '아야네(수영복)', 101, 1, 1, 3, 2),
    (109, '노노미(수영복)', 101, 3, 6, 1, 6),
    (110, '호시노(수영복)', 101, 3, 5, 1, 6),
    #게헨나
    (201, '아루', 201, 3, 4, 1, 2),
    (202, '무츠키', 201, 2, 6, 1, 2),
    (203, '카요코', 201, 2, 1, 1, 4),
    (204, '하루카', 201, 1, 5, 1, 2),
    (205, '히나', 202, 3, 6, 1, 4),
    (206, '이오리', 202, 3, 4, 3, 4),
    (207, '치나츠', 202, 1, 1, 3, 2),
    (208, '아코', 202, 3, 1, 5, 4),
    (209, '하루나', 203, 3, 4, 5, 4),
    (210, '이즈미', 203, 3, 6, 1, 2),
    (211, '준코', 203, 2, 3, 3, 2),
    (212, '아카리', 203, 2, 3, 1, 4),
    (213, '후우카', 204, 2, 2, 1, 4),
    (214, '주리', 204, 1, 5, 1, 2),
    (215, '세나', 205, 3, 7, 5, 2),
    (216, '이로하', 206, 3, 1, 5, 4),
    (217, '히나(수영복)', 202, 3, 6, 1, 4),
    (218, '이오리(수영복)', 202, 3, 4, 1, 6),
    (219, '이즈미(수영복)', 203, 1, 6, 1, 2),
    (220, '치나츠(온천)', 202, 3, 1, 5, 2),
    (221, '아루(새해)', 201, 3, 4, 3, 6),
    (222, '무츠키(새해)', 201, 3, 6, 5, 4),
    (223, '카요코(새해)', 201, 3, 1, 5, 6),
    (224, '하루카(새해)', 201, 3, 5, 1, 2),
    (225, '하루나(새해)', 203, 3, 4, 1, 2),
    (226, '후우카(새해)', 204, 3, 2, 3, 6),
    (227, '준코(새해)', 203, 1, 3, 5, 4),
    (228, '메구', 207, 3, 11, 1, 6),
    #밀레니엄
    (301, '유우카', 301, 2, 2, 1, 4),
    (302, '노아', 301, 3, 1, 5, 6),
    (303, '코유키', 301, 3, 6, 5, 4),
    (304, '마키', 302, 3, 6, 3, 2),
    (305, '하레', 302, 2, 3, 1, 2),
    (306, '코타마', 302, 1, 1, 1, 2),
    (307, '치히로', 302, 3, 3, 3, 4),
    (308, '네루', 303, 3, 2, 3, 2),
    (309, '카린', 303, 3, 4, 3, 4),
    (310, '아카네', 303, 3, 1, 3, 2),
    (311, '아스나', 303, 1, 3, 5, 2),
    (312, '토키', 303, 3, 3, 1, 8),
    (313, '히비키', 304, 3, 10, 1, 4),
    (314, '우타하', 304, 2, 2, 3, 4),
    (315, '코토리', 304, 1, 6, 3, 2),
    (316, '에이미', 305, 3, 5, 1, 2),
    (317, '히마리', 305, 3, 1, 3, 2),
    (318, '스미레', 306, 3, 5, 3, 6),
    (319, '모모이', 307, 2, 3, 3, 2),
    (320, '미도리', 307, 3, 4, 3, 2),
    (321, '아리스', 307, 3, 9, 5, 6),
    (322, '유즈', 307, 3, 7, 3, 6),
    (323, '네루(바니걸)', 303, 3, 2, 1, 4),
    (324, '카린(바니걸)', 303, 3, 4, 5, 4),
    (325, '아스나(바니걸)', 303, 3, 3, 5, 2),
    (326, '아카네(바니걸)', 303, 3, 1, 5, 4),
    (327, '우타하(응원단)', 304, 3, 2, 5, 6),
    (328, '히비키(응원단)', 304, 1, 10, 1, 2),
    (329, '유우카(체육복)', 301, 3, 2, 5, 6),
    (330, '아리스(메이드)', 307, 3, 9, 5, 2),
    (331, '유즈(메이드)', 307, 1, 7, 1, 8),
    (332, '토키(바니걸)', 303, 3, 3, 1, 2),
    #트리니티
    (401, '히후미', 401, 3, 3, 3, 2),
    (402, '아즈사', 401, 3, 3, 1, 4),
    (403, '하나코', 401, 2, 3, 3, 6),
    (404, '코하루', 401, 3, 4, 1, 4),
    (405, '스즈미', 402, 1, 3, 1, 4),
    (406, '레이사', 402, 3, 5, 3, 4),
    (407, '시미코', 403, 1, 3, 1, 2),
    (408, '우이', 403, 3, 4, 1, 2),
    (409, '아이리', 404, 2, 2, 1, 2),
    (410, '요시미', 404, 1, 3, 3, 4),
    (411, '나츠', 404, 3, 2, 5, 4),
    (412, '카즈사', 404, 3, 6, 3, 4),
    (413, '하나에', 405, 2, 3, 1, 4),
    (414, '세리나', 405, 1, 3, 5, 2),
    (415, '미네', 405, 3, 5, 1, 2),
    (416, '마시로', 406, 3, 4, 1, 4),
    (417, '츠루기', 406, 3, 5, 3, 4),
    (418, '하스미', 406, 2, 4, 3, 4),
    (419, '마리', 407, 2, 1, 5, 6),
    (420, '히나타', 407, 3, 1, 5, 4),
    (421, '사쿠라코', 407, 3, 3, 5, 6),
    (422, '아즈사(수영복)', 401, 3, 3, 5, 2),
    (423, '마시로(수영복)', 406, 3, 4, 5, 2),
    (424, '히후미(수영복)', 401, 3, 3, 3, 4),
    (425, '츠루기(수영복)', 406, 1, 5, 5, 6),
    (426, '하스미(체육복)', 406, 1, 4, 5, 6),
    (427, '마리(체육복)', 407, 3, 1, 5, 6),
    (428, '세리나(크리스마스)', 405, 3, 3, 3, 6),
    (429, '하나에(크리스마스)', 405, 3, 3, 5, 6),
    (430, '미카', 408, 3, 2, 3, 2),
    (431, '나기사', 408, 3, 1, 1, 4),
    #백귀야행
    (501, '시즈코', 501, 2, 5, 5, 6),
    (502, '피나', 501, 1, 6, 3, 2),
    (503, '치세', 502, 2, 7, 5, 4),
    (504, '카호', 502, 3, 3, 5, 4),
    (505, '츠바키', 503, 2, 2, 3, 4),
    (506, '미모리', 503, 3, 1, 5, 2),
    (507, '카에데', 503, 3, 1, 1, 6),
    (508, '이즈나', 504, 3, 2, 5, 2),
    (509, '미치루', 504, 1, 5, 5, 2),
    (510, '츠쿠요', 504, 3, 2, 5, 2),
    (511, '와카모', 599, 3, 4, 5, 2),
    (512, '와카모(수영복)', 599, 3, 4, 3, 4),
    (513, '시즈코(수영복)', 501, 1, 5, 5, 4),
    (514, '이즈나(수영복)', 504, 3, 2, 5, 6),
    (515, '치세(수영복)', 502, 3, 7, 5, 2),
    #산해경
    (601, '사야', 601, 3, 1, 1, 2),
    (602, '슌', 602, 3, 4, 1, 2),
    (603, '코코나', 602, 3, 3, 3, 6),
    (604, '슌(어린이)', 602, 3, 4, 1, 2),
    (605, '사야(사복)', 601, 3, 1, 3, 6),
    #붉은겨울
    (701, '체리노', 701, 3, 1, 3, 2),
    (702, '토모에', 701, 1, 4, 3, 6),
    (703, '마리나', 701, 3, 2, 3, 2),
    (704, '노도카', 702, 1, 2, 1, 4),
    (705, '시구레', 702, 3, 7, 1, 4),
    (706, '체리노(온천)', 701, 3, 1, 1, 4),
    (707, '노도카(온천)', 702, 3, 2, 1, 6),
    #발키리
    (801, '키리노', 801, 2, 1, 1, 6),
    (802, '후부키', 801, 1, 4, 3, 4),
    (803, '칸나', 802, 3, 1, 3, 4),
    #SRT
    (901, '미야코', 901, 3, 2, 3, 4),
    (902, '사키', 901, 3, 6, 3, 6),
    (903, '미유', 901, 3, 4, 3, 2),
    (904, '모에', 901, 3, 1, 3, 2),
    #아리우스
    (1001, '미사키', 1001, 3, 8, 1, 6),
    (1002, '히요리', 1001, 3, 4, 1, 2),
    (1003, '아츠코', 1001, 3, 2, 1, 6),
    (1004, '사오리', 1001, 3, 3, 1, 6),
    #그 외
    (9901, '미쿠', 9999, 3, 7, 1, 2);
    
INSERT INTO academy VALUES
    #아비도스
    (101, 1, '대책위원회'),
    (199, 1, '없음'),
    #게헨나
    (201, 2, '흥신소68'),
    (202, 2, '선도부'),
    (203, 2, '미식연구회'),
    (204, 2, '급양부'),
    (205, 2, '응급의학부'),
    (206, 2, '만마전'),
    (207, 2, '온천개발부'),
    (299, 2, '없음'),
    #밀레니엄
    (301, 3, '세미나'),
    (302, 3, '베리타스'),
    (303, 3, 'C&C'),
    (304, 3, '엔지니어부'),
    (305, 3, '초현상특무부'),
    (306, 3, '트레이닝 클럽'),
    (307, 3, '게임개발부'),
    (399, 3, '없음'),
    #트리니티
    (401, 4, '보충수업부'),
    (402, 4, '자경단'),
    (403, 4, '도서부'),
    (404, 4, '방과후 디저트부'),
    (405, 4, '구호기사단'),
    (406, 4, '정의실현부'),
    (407, 4, '시스터후드'),
    (408, 4, '티파티'),
    (499, 4, '없음'),
    #백귀야행
    (501, 5, '마츠리운영관리부'),
    (502, 5, '음양부'),
    (503, 5, '수행부'),
    (504, 5, '인술연구부'),
    (599, 5, '없음'),
    #산해경
    (601, 6, '연단방'),
    (602, 6, '매화원'),
    (699, 6, '없음'),
    #붉은겨울
    (701, 7, '붉은겨울 사무국'),
    (702, 7, '227호 특별반'),
    (799, 7, '없음'),
    #발키리
    (801, 8, '생활안전국'),
    (802, 8, '공안국'),
    (899, 8, '없음'),
    #SRT
    (901, 9, 'RABBIT 소대'),
    (999, 9, '없음'),
    #아리우스
    (1001, 10, '아리우스 스쿼드'),
    (1099, 10, '없음'),
    #그 외
    (9999, 99, '없음');
    
INSERT INTO academyid VALUES
    (1, '아비도스 고등학교'),
    (2, '게헨나 학원'),
    (3, '밀레니엄 사이언스 스쿨'),
    (4, '트리니티 종합학원'),
    (5, '백귀야행 연합학원'),
    (6, '산해경 고급중학교'),
    (7, '붉은겨울 연방학원'),
    (8, '발키리 경찰학교'),
    (9, 'SRT 특수학원'),
    (10, '아리우스 분교'),
    (99, '그 외');
    
INSERT INTO weapon VALUES
    (1, '권총(HG)'),
    (2, '기관단총(SMG)'),
    (3, '돌격소총(AR)'),
    (4, '저격총(SR)'),
    (5, '샷건(SG)'),
    (6, '기관총(MG)'),
    (7, '유탄발사기(GL)'),
    (8, '로켓런처(RL)'),
    (9, '레일건(RG)'),
    (10, '박격포(MT)'),
    (11, '화염방사기(FT)');
  
INSERT INTO Atype VALUES
    (1, '폭발'),
    (3, '관통'),
    (5, '신비'),
    (7, '진동');
    
INSERT INTO Dtype VALUES
    (2, '경장갑'),
    (4, '중장갑'),
    (6, '특수장갑'),
    (8, '탄력장갑');

# Join
SHOW TABLES;
SELECT * FROM student;
SELECT * FROM academy;
SELECT * FROM weapon;
SELECT * FROM Atype;
SELECT * FROM Dtype;

SELECT student.id, st_name AS '이름', aca_name AS '학원', club AS '동아리', star AS '성급', Atype.types AS '공격타입', Dtype.types AS '방어타입' FROM student 
    LEFT JOIN academy ON academy.id = student.academy_id
    LEFT JOIN academyid ON academyid.id = academy.aca_id
    LEFT JOIN weapon ON weapon.id = student.weapon_type
    LEFT JOIN Atype ON Atype.id = student.attack_type
    LEFT JOIN Dtype ON Dtype.id = student.defence_type
    ORDER BY student.id ASC;
